Repository: MonDevHub/monocr
Catalog: apps/ios/monocr-ios/Localizable.xcstrings
Source language: en
Languages: mnw, my

source: 1. Zero Data Collection Promise
mnw: ၁။ ဟွံစၟတ်သမ္တီ တင်ဂရင်ဏအ်
my: ၁။ အချက်အလက်များ လုံးဝသိမ်းဆည်းခြင်းမပြုရန် ကတိကဝတ်

source: 2. Processing of Images
mnw: ၂။ စၟတ်သမ္တီပုံဂမၠိုင်
my: ၂။ ပုံများကို ကိုင်တွယ်ဆောင်ရွက်ခြင်း

source: 3. Voluntary Feedback and Contributions
mnw: ၃။ ဗိုင်ရီုပလံင် တင်တုံ့ပြန်ဂမၠိုင်
my: ၃။ မိမိဆန္ဒအလျောက် ပါဝင်ကူညီမှုနှင့် တုံ့ပြန်ချက်များ

source: 4. Diagnostic Data
mnw: ၄။ တင်ဂရင် စနစ်
my: ၄။ စနစ်စစ်ဆေးချက် အချက်အလက်များ

source: 5. Changes to This Policy
mnw: ၅။ လှာဲမူဝါဒ
my: ၅။ မူဝါဒဆိုင်ရာ ပြောင်းလဲမှုများ

source: 6. Contact Us
mnw: ၆။ ဆက်သွယ်ရန်
my: ၆။ ဆက်သွယ်ရန်

source: 100% Local Processing
mnw: ၁၀၀% Local Processing
my: ၁၀၀% စက်အတွင်း၌သာ လုပ်ဆောင်သည်

source: 300 DPI min. 600 DPI for manuscripts.
mnw: အနည်းဆုံး ၃၀၀ DPI ရှိရမည်။ ရှေးဟောင်းပေမူများအတွက် ၆၀၀ DPI အသုံးပြုပါ။
my: အနည်းဆုံး ၃၀၀ DPI ရှိရမည်။ ရှေးဟောင်းပေမူများအတွက် ၆၀၀ DPI အသုံးပြုပါ။

source: About
mnw: ပရူ
my: အကြောင်း

source: Academic-grade OCR engine for Mon script. High-performance, private, and localized.
my: မွန်ဘာသာစကားအတွက် အဆင့်မြင့် အေအိုင် (AI) နည်းပညာသုံး စာသားဖတ်စနစ်။ လုံခြုံစိတ်ချရပြီး တိကျမြန်ဆန်သည်။

source: Accuracy Feedback
mnw: တင်တုံ့ပြန် တိကျမှု
my: တိကျမှုဆိုင်ရာ တုံ့ပြန်ချက်များ

source: Allow this feedback to be used for model verification and archival research.
mnw: ကဵုအခေါင် စကာတင်ဂရင်ဏအ် သွက်ဂွံစၟတ်သမ္တီ မော်ဒယ် ညိ။
my: ဤအချက်အလက်များကို မော်ဒယ်စစ်ဆေးခြင်းနှင့် သုတေသနလုပ်ငန်းများတွင် အသုံးပြုခွင့်ပေးပါ။

source: Any images you select from your library or capture via your camera are loaded straight into the Neural Processing Unit (ANE) on your local hardware. The original image and the generated text extraction both remain isolated in your device's memory.
my: သင်ရွေးချယ်လိုက်သော သို့မဟုတ် ဓာတ်ပုံရိုက်လိုက်သောပုံများကို သင့်စက်၏ Neural Processing Unit (ANE) အတွင်းသို့ တိုက်ရိုက်ထည့်သွင်းလုပ်ဆောင်ပါသည်။ မူရင်းပုံနှင့် ထွက်ပေါ်လာသောစာသားများအားလုံးကို သင့်စက်၏မှတ်ဉာဏ်အတွင်း၌သာ သီးသန့်ထားရှိပါသည်။

source: Application
my: အက်ပလီကေးရှင်း

source: Architecture
my: နည်းပညာ (Architecture)

source: Are you sure?
mnw: သေချာဟာ?
my: သေချာပါသလား?

source: Because we do not collect data, we do not anticipate needing to update this policy often. If fundamental changes to the application architecture occur, we will reflect those in our open source repositories and in-app documentation.
my: ကျွန်ုပ်တို့သည် အချက်အလက်များ သိမ်းဆည်းခြင်းမပြုသောကြောင့် ဤမူဝါဒကို မကြာခဏပြောင်းလဲရန် မလိုအပ်ပါ။ အကယ်၍ အက်ပလီကေးရှင်း၏ နည်းပညာဆိုင်ရာ အခြေခံအချက်များ ပြောင်းလဲသွားပါက open source repositories နှင့် အက်ပလီကေးရှင်းအတွင်း၌ အသိပေးသွားမည်ဖြစ်သည်။

source: Burmese
mnw: ဗမာ (Burmese)
my: ဗမာ (Burmese)

source: Camera
mnw: ရိုက်ပုံ
my: ဓာတ်ပုံရိုက်မည်

source: Cancel and discard
mnw: ဟွံပလံင်
my: မလုပ်တော့ပါ

source: Change Source
mnw: လှာဲပုံ
my: ပုံပြောင်းမည်

source: Clear
mnw: ပလီု
my: ဖျက်မည်

source: Clear All
mnw: ပလီုဖအိုတ်
my: အားလုံးဖျက်မည်

source: Clear All History
mnw: ပလီုတင်မစၟတ်လဝ်ဖအိုတ်
my: မှတ်တမ်းအားလုံးဖျက်မည်

source: CLI Usage
mnw: စကာ CLI
my: CLI အသုံးပြုပုံ

source: Close result
mnw: ပိတ်
my: ပိတ်မည်

source: Contribute
mnw: ဗိုင်ရီု
my: ပါဝင်ကူညီရန်

source: Contribute Mon documents to improve accuracy and archival quality.
mnw: ဗိုင်ရီုပလံင် လိခ်မန် သွက်ဂွံထိန်းသိမ်း ဗွဲမတၟေင်။
my: တိကျမှုနှင့် မော်ကွန်းထိန်းသိမ်းမှု ပိုမိုကောင်းမွန်စေရန် မွန်စာရွက်စာတမ်းများကို ပေးပို့လှူဒါန်းပါ။

source: Contributions
mnw: တင်ပလံင်လဝ်ဂမၠိုင်
my: ပေးပို့ထားသော မှတ်တမ်းများ

source: Copied
mnw: ကွုတ်တုဲ
my: ကူးယူပြီး

source: Copied to clipboard
mnw: ကွုတ်လိခ်တုဲရ
my: ကူးယူပြီးပါပြီ

source: Copy to Clipboard
mnw: ကွုတ်လိခ်
my: စာသားကူးယူမည်

source: Corrected Mon script...
mnw: လိခ်မန်မဒး...
my: ပြင်ဆင်ထားသော မွန်စာသား...

source: Corrected Text
mnw: လိခ်မဒး
my: ပြင်ဆင်ထားသော စာသား

source: Diffuse lighting, no glares.
my: အလင်းရောင် အညီအမျှရရှိရမည်၊ ရောင်ပြန်ဟပ်မှုမရှိရ။

source: Docs
mnw: လိခ်စညှန်
my: လမ်းညွှန်

source: Documentation
mnw: ပရူ
my: အကြောင်း

source: Documents are processed entirely on your local machine. No data is uploaded to our servers.
mnw: လိခ်ဂမၠိုင် စၟတ်သမ္တီလဝ် ပ္ဍဲစက်မၞးဟေင်။ ဟွံUpload တင်ဂရင်ဏအ် ပ္ဍဲ server ပိုဲ။
my: စာရွက်စာတမ်းများကို သင့်စက်အတွင်း၌သာ လုပ်ဆောင်သည်။ မည်သည့်အချက်အလက်ကိုမှ ဆာဗာပေါ်သို့ တင်ခြင်းမရှိပါ။

source: Done
mnw: တုဲရ
my: ပြီးပြီ

source: Effective Date: March 21, 2026
mnw: စၟတ်တ္ၚဲ မတ်လ ၂၁ ရက်၊ ၂၀၂၆ ခုနှစ်
my: အသက်ဝင်သည့်ရက်စွဲ - မတ်လ ၂၁ ရက်၊ ၂၀၂၆ ခုနှစ်

source: Engine not initialized. Please try restarting the scan.
mnw: Engine ဟွံအဆင်ပြေဏီ။ ကျေးဇူးပြု၍ စကၠရုတ်မွဲဝါပၠန်။
my: အင်ဂျင် အဆင်သင့်မဖြစ်သေးပါ။ ကျေးဇူးပြု၍ ပြန်လည်စတင်ပါ။

source: Engine ready
my: အင်ဂျင် အဆင်သင့်ဖြစ်ပါပြီ

source: English
mnw: အင်္ဂလိပ် (English)
my: အင်္ဂလိပ် (English)

source: Error Type
mnw: သာ်အမှား
my: အမှားအမျိုးအစား

source: Error: %@
mnw: တင်အမှား - %@
my: အမှားအယွင်း - %@

source: Example: မန်ဒိုင် (Type or paste the Mon script here)...
mnw: ဥပမာ: မန်ဒိုင် (မိန် သာ်ဟွံသေင် ကွုတ်လိခ်မန် ပ္ဍဲဏအ်ညိ)...
my: ဥပမာ: မန်ဒိုင် (ဤနေရာတွင် မွန်စာရိုက်ပါ သို့မဟုတ် ကူးထည့်ပါ)...

source: Export Debug Logs
my: စနစ်စစ်ဆေးချက်မှတ်တမ်းများ ထုတ်ယူမည်

source: File Selected
mnw: ဖိုင်ရွေးချယ်ထားပါသည်
my: ဖိုင်ရွေးချယ်ထားပါသည်

source: File size limit exceeded
my: ဖိုင်အရွယ်အစား ကန့်သတ်ချက်ထက် ကျော်လွန်နေသည်

source: File too large (Max 50MB). Use CLI tools or desktop version for bigger file support.
my: ဖိုင်အရွယ်အစား ကြီးလွန်းနေသည် (အများဆုံး ၅၀MB)။ ပိုမိုကြီးမားသောဖိုင်များအတွက် CLI သို့မဟုတ် Desktop ဗားရှင်းကို အသုံးပြုပါ။

source: Follow these standards to achieve maximum recognition accuracy (97.5%+).
mnw: ဗက်စံနှုန်းဏအ် သွက်ဂွံဂွံ တင်တိကျအိုတ် (97.5%+)
my: အကောင်းဆုံးတိကျမှု (၉၇.၅%+) ရရှိရန် ဤစံနှုန်းများကို လိုက်နာပါ။

source: Formatting
my: ဖောင့်/အထားအသို

source: Gallery
mnw: ပုံ
my: ပုံရွေးရန်

source: I want to help improve MonOCR
mnw: မိက်ဂွံဗိုင်ရီု MonOCR
my: MonOCR ကောင်းမွန်စေရန် ကူညီလိုပါသည်

source: If you choose to use the "Feedback" or "Contribute" features within our mobile applications, that data is saved locally to an offline database using SwiftData. It is not transmitted anywhere unless you manually choose to export and share those logs or screenshots with our engineering team via your own sharing apps (Email, Messages, etc.).
my: သင်သည် "တုံ့ပြန်ချက်" သို့မဟုတ် "ပါဝင်ကူညီရန်" ကဏ္ဍများကို အသုံးပြုပါက ထိုအချက်အလက်များကို SwiftData အသုံးပြု၍ သင့်စက်အတွင်း၌သာ သိမ်းဆည်းထားမည်ဖြစ်သည်။ သင်ကိုယ်တိုင် မှတ်တမ်းများကို ထုတ်ယူပြီး (Email သို့မဟုတ် Messages စသည်တို့မှတစ်ဆင့်) ကျွန်ုပ်တို့အဖွဲ့ထံသို့ ပေးပို့ခြင်းမရှိမချင်း မည်သည့်နေရာသို့မှ ရောက်ရှိသွားမည်မဟုတ်ပါ။

source: If you have any questions about this privacy statement, please contact the MonDevHub engineering team via our public open source repositories on GitHub.
my: ဤကိုယ်ရေးကိုယ်တာမူဝါဒနှင့် ပတ်သက်၍ သိရှိလိုသည်များရှိပါက GitHub ရှိ ကျွန်ုပ်တို့၏ public open source repositories မှတစ်ဆင့် MonDevHub အဖွဲ့ကို ဆက်သွယ်နိုင်ပါသည်။

source: Image or PDF
mnw: ပုံ သာ်ဟွံသေင် PDF
my: ပုံ သို့မဟုတ် ပီဒီအက်ဖ်

source: Initializing engine...
my: အင်ဂျင်ကို စတင်နေသည်...

source: Input
my: ထည့်သွင်းမှု (Input)

source: Input Standards
mnw: စံနှုန်းထည့်သွင်းမှု
my: ထည့်သွင်းရမည့် စံနှုန်းများ

source: Install the latest stable release of the MonOCR engine via our package manager.
mnw: တပ်ဆင် MonOCR engine ဗွဲမခိုင်ကၠိုက်။
my: ကျွန်ုပ်တို့၏ package manager မှတစ်ဆင့် MonOCR အင်ဂျင်၏ နောက်ဆုံးထွက်ဗားရှင်းကို ရယူတပ်ဆင်ပါ။

source: Installation
mnw: တပ်ဆင်ခြင်း
my: တပ်ဆင်ခြင်း

source: Internal Error: %@
mnw: တင်အမှားစနစ် - %@
my: စနစ်အတွင်း အမှားအယွင်း - %@

source: Language
mnw: ဘာသာ
my: ဘာသာစကား

source: Layout
my: ပုံစံ (Layout)

source: Learn more about CLI
mnw: ဗက်လ္ၚာ CLI
my: CLI အကြောင်း ပိုမိုလေ့လာရန်

source: Lighting
mnw: အလင်းရောင်
my: အလင်းရောင်

# main_scanning
source: Scanning...
mnw: စၟဳစၟတ်မံင်...
my: စစ်ဆေးနေသည်...

source: Model '%@' not found. Ensure .mlpackage is added to the app target in Xcode.
mnw: ဟွံဂွံဆဵု မော်ဒယ် '%@' ပ္ဍဲ bundle။
my: မော်ဒယ် '%@' ကို ရှာမတွေ့ပါ။ Xcode တွင် ပေါင်းထည့်ထားခြင်း ရှိမရှိ စစ်ဆေးပါ။

source: Model Hub
mnw: ဗဟိုဌာန မော်ဒယ်
my: မော်ဒယ်ဗဟိုဌာန

source: Model Information
my: မော်ဒယ်အချက်အလက်

source: Model Size
my: မော်ဒယ်အရွယ်အစား

source: Mon
mnw: ဘာသာမန် (Mon)
my: ဘာသာမန် (Mon)

source: MonOCR is built from the ground up for absolute privacy. Our edge-AI architecture ensures that 100% of optical character recognition (OCR) processing occurs entirely on your device. We do not use loud telemetry, we do not require an account, and we do not transmit your photos or documents to any external server.
my: MonOCR ကို ကိုယ်ရေးကိုယ်တာလုံခြုံမှုအတွက် အထူးရည်ရွယ်တည်ဆောက်ထားပါသည်။ ကျွန်ုပ်တို့၏ နည်းပညာအရ စာသားဖတ်ခြင်းလုပ်ငန်းစဉ် ၁၀၀ ရာခိုင်နှုန်းလုံးကို သင့်စက်အတွင်း၌သာ လုပ်ဆောင်ပါသည်။ ကျွန်ုပ်တို့သည် သင်၏အသုံးပြုမှုများကို စောင့်ကြည့်ခြင်းမပြုပါ၊ အကောင့်ပြုလုပ်ရန် မလိုအပ်ပါ၊ သင်၏ဖိုင်များကိုလည်း မည်သည့်ဆာဗာသို့မှ ပေးပို့ခြင်းမရှိပါ။

source: Multi-Platform SDKs
mnw: SDK ဂမၠိုင်
my: Platform ပေါင်းစုံအတွက် SDK များ

source: No history found
mnw: ဟွံဂွံဆဵု တင်မစၟတ်လဝ်
my: မှတ်တမ်းမရှိသေးပါ

source: Official libraries for high-performance inference.
mnw: Official libraries သွက်ဂွံ inference.
my: အဆင့်မြင့်စာသားဖတ်စနစ်အတွက် တရားဝင်ထုတ်ပြန်ထားသော libraries များ။

source: OR
mnw: သာ်ဟွံသေင်
my: သို့မဟုတ်

source: Original Output
my: မူရင်းထွက်ရှိချက်

source: Original Source
mnw: မူရင်းအရင်းအမြစ်
my: မူရင်းအရင်းအမြစ်

source: Other
mnw: တၞဟ်တၞဟ်
my: အခြား

source: Our production weights and multi-format exports are hosted on Hugging Face.
my: ကျွန်ုပ်တို့၏ မော်ဒယ်များနှင့် ဖိုင်အမျိုးမျိုးကို Hugging Face တွင် ရယူနိုင်ပါသည်။

source: Overview
mnw: အကျဉ်း
my: အကျဉ်းချုပ်

source: Parameters
my: ကန့်သတ်ချက်များ (Parameters)

source: PDF
my: ပီဒီအက်ဖ် (PDF)

source: PDF, Images, or Structured Text
mnw: PDF, ပုံ သာ်ဟွံသေင် လိခ်ဂမၠိုင်
my: PDF၊ ပုံများ သို့မဟုတ် စာသားများ

source: Pending
mnw: ပမင်ဒၟံင်
my: စောင့်ဆိုင်းဆဲ

source: Precision
my: တိကျမှုအဆင့် (Precision)

source: Preserve Our Heritage
mnw: မင်မွဲ အာဲကၟာဲပိုဲ
my: ကျွန်ုပ်တို့၏ အမွေအနှစ်ကို ထိန်းသိမ်းစို့

source: Privacy
mnw: ကိုယ်ရေးကိုယ်တာ
my: ကိုယ်ရေးကိုယ်တာ

source: Privacy Policy
my: ကိုယ်ရေးကိုယ်တာမူဝါဒ

source: Privacy-First OCR
mnw: လုံခြုံမှုကို အလေးထားသော OCR
my: လုံခြုံမှုကို အလေးထားသော OCR

source: Privacy-first on-device OCR for the Mon language. No images leave your device — all recognition runs locally using native Apple Core ML.
my: မွန်ဘာသာစကားအတွက် ကိုယ်ပိုင်အချက်အလက်လုံခြုံမှုကို အလေးထားသော စာသားဖတ်စနစ်။ ပုံများကို မည်သည့်နေရာသို့မှ ပေးပို့ခြင်းမရှိဘဲ သင့်စက်အတွင်း၌သာ Apple Core ML နည်းပညာဖြင့် လုပ်ဆောင်သည်။

source: Recent Scans
mnw: တင်မစၟတ်လဝ်ဂမၠိုင်
my: လတ်တလော စစ်ဆေးမှုများ

source: Remove selected source
mnw: ပလီု
my: ဖျက်မည်

source: Report
mnw: ဗိုင်ရီုပလံင်တင်အမှား
my: အမှားတင်ပြရန်

source: Report quality issues to help improve our model
mnw: ဗိုင်ရီုတိုင်ကြား အမှား သွက်ဂွံဖန်ဗဒှ် မော်ဒယ်တၟိညိ
my: မော်ဒယ်ပိုမိုကောင်းမွန်စေရန် အမှားအယွင်းများကို တိုင်ကြားပါ

source: Resolution
my: Resolution အဆင့်

source: Resources
my: အရင်းအမြစ်များ

source: Scan Result
my: စစ်ဆေးမှုရလဒ်

source: Scanning Mon text...
mnw: Scanning...
my: မွန်စာသားများ ဖတ်နေသည်...

source: Select an image or use the camera to extract Mon text.
my: မွန်စာသားများ ဖတ်ရှုနိုင်ရန် ပုံရွေးချယ်ပါ သို့မဟုတ် ဓာတ်ပုံရိုက်ပါ။

source: Selected image
mnw: ရွေးချယ်ထားသောပုံ
my: ရွေးချယ်ထားသောပုံ

source: Selected scan
my: ရွေးချယ်ထားသောပုံ

source: Share Correction
mnw: ပလံင် တင်ပြင်ဒး
my: ပြင်ဆင်ချက်ပေးပို့မည်

source: Spelling
mnw: အက္ခရာ
my: စာလုံးပေါင်း

source: Submit Contribution
mnw: ပလံင်
my: ပေးပို့မည်

source: Submit Mon Documents
mnw: ပလံင် လိခ်မန်
my: မွန်စာရွက်စာတမ်းများ တင်ရန်

source: Synced
mnw: ပလံင်တုဲ
my: သိမ်းဆည်းပြီး

source: Text Content
my: စာသားအကြောင်းအရာ

source: This will permanently delete all scans in this category.
my: ဤအမျိုးအစားရှိ စစ်ဆေးမှုမှတ်တမ်းအားလုံးကို အပြီးတိုင်ဖျက်ပစ်ပါလိမ့်မည်။

source: To maintain our strict privacy compliance, we do not use third-party cloud crash reporters. Diagnostic logs are written to your local file system on a rolling basis. You are in full control of these logs and can export them voluntarily if you encounter bugs.
my: ကိုယ်ရေးကိုယ်တာလုံခြုံမှုအတွက် ပြင်ပ cloud crash reporters များကို အသုံးပြုခြင်းမပြုပါ။ စနစ်စစ်ဆေးချက်မှတ်တမ်းများကို သင့်စက်အတွင်း၌သာ သိမ်းဆည်းထားပြီး အမှားအယွင်းများရှိပါက သင်ကိုယ်တိုင် စစ်ဆေးထုတ်ယူနိုင်ပါသည်။

source: Type Mon Script
mnw: မိန် လိခ်မန်
my: မွန်စာသား ရိုက်ထည့်ပါ

source: Upload Original Scan
mnw: ပလံင်ပုံမူရင်း
my: မူရင်းပုံကို တင်ပါ

source: Use the command line interface for processing large PDFs (>50MB) or batch folders.
mnw: စကာ command line သွက်ဂွံစၟတ် PDF ဇၞော် (>50MB)။
my: ၅၀MB ထက်ကြီးသော PDF ဖိုင်များ သို့မဟုတ် ဖိုင်တွဲအလိုက် ဖတ်ရှုလိုပါက CLI ကို အသုံးပြုပါ။

source: Val CER
mnw: CER
my: အမှားနှုန်း (CER)

source: VERIFIED BY HUMANS
mnw: စၟတ်သမ္တီလဝ် နကဵုမၞး
my: လူကိုယ်တိုင် စစ်ဆေးပြီး

source: Visit Hugging Face
my: Hugging Face သို့ သွားမည်

# nav_home
source: Home
mnw: သ္ၚိ
my: ပင်မ

# nav_docs
source: Docs
mnw: လိခ်ဗွဟ်
my: စာရွက်စာတမ်း

# nav_about
source: About
mnw: ပရော
my: အကြောင်း

# nav_feedback
source: Feedback
mnw: ကမၠေၚ်ကသပ်
my: တုံ့ပြန်ချက်

# nav_contribute
source: Contribute
mnw: ဗိုင်ရီုညိ
my: ပါဝင်ကူညီရန်

# nav_toggle_menu
source: Toggle Menu
mnw: ပံက်/ကၟာတ် မီနူး
my: မီနူး ဖွင့်/ပိတ်

# nav_close_menu
source: Close Menu
mnw: ကၟာတ် မီနူး
my: မီနူး ပိတ်ရန်

# footer_copy
source: © {year} MonOCR Project. Preserving Mon Heritage.
mnw: © {year} ပရဝ်ဂျေသူ MonOCR သွက်ဂွံမင်မွဲအာ လိခ်မန်။
my: © {year} မွန် OCR ပရောဂျက်။ မွန်အမွေအနှစ် ထိန်းသိမ်းစောင့်ရှောက်ရေး။

# footer_tech
source: Open Source OCR running in your browser. Using {ocrs} and {onnx}.
mnw: ဒှ် Open Source သွက်ဂွံစကာအာ ပ္ဍဲကဵု browser။ စကာလဝ် {ocrs} ကဵု {onnx}။
my: ဘရောက်ဇာတွင် အသုံးပြုနိုင်သော Open Source OCR။ {ocrs} နှင့် {onnx} ကို အသုံးပြုထားသည်။

# nav_privacy
source: Privacy
mnw: ပရောပူဂဵု တင်မဒးဂိုင်ဒေပ်ပၞုက်လဝ်
my: ကိုယ်ရေးလုံခြုံမှု

# nav_mon_heritage
source: Vulnerable Language
mnw: ဘာသာ မဒးမင်မွဲ
my: ထိန်းသိမ်းရန် လိုအပ်သော ဘာသာစကား

# about_title
source: About MonOCR
mnw: ပရူ MonOCR
my: မွန် OCR အကြောင်း

# about_vulnerable
source: Mon (mnw) is my mother tongue. It is currently classified as a vulnerable language by UNESCO.
mnw: ဘာသာမန် (mnw) ဂှ် ဒှ်အရေဝ်မိအဲရ။ ပ္ဍဲအခိင်လၟုဟ် ညးစကာအောန်စှ်ေကၠုင်တုဲ UNESCO ဟီုလဝ် ဒှ်ဘာသာ မဒးမင်မွဲရ။
my: မွန်ဘာသာစကား (mnw) သည် ကျွန်ုပ်၏ မိခင်ဘာသာစကား ဖြစ်သည်။ လက်ရှိတွင် UNESCO မှ ထိန်းသိမ်းရန် လိုအပ်သော ဘာသာစကားအဖြစ် သတ်မှတ်ထားသည်။

# about_digital_presence
source: The biggest challenge is the lack of digital presence for Mon. This makes AI development difficult since most texts are in scanned books.
mnw: ပြသနာဇၞော်အိုတ်ဂှ် ပ္ဍဲကဵုလောက ဒစ်ဂျစ်တယ်ဂှ် လိခ်မန်ပိုဲ နွံအောန်ကွေဟ်ရ။ ဟိုတ်ဂှ်တုဲ သွက်ဂွံပတုဲအာ ကမၠောန် AI ဂှ် ဝါတ်ဂါတ်ဒၟံင်ရ။ လိခ်ပိုဲ ဗွဲမဂၠိုင်ဂှ် နွံဒၟံင် ပ္ဍဲကဵု လိခ်ကၞပ် စကင်န်တအ်ရ။
my: အကြီးမားဆုံး စိန်ခေါ်မှုမှာ မွန်ဘာသာစကား၏ ဒစ်ဂျစ်တယ် တည်ရှိမှု နည်းပါးခြင်းဖြစ်သည်။ ထို့ကြောင့် AI ဖွံ့ဖြိုးတိုးတက်မှုအတွက် ခက်ခဲစေသည်။

# about_effort
source: To increase digital presence, I developed this OCR engine. It uses MobileNetV3 + BiLSTM for efficient inference.
mnw: သွက်ဂွံဇမြော်ပတိုန် လိခ်မန် ပ္ဍဲလောက ဒစ်ဂျစ်တယ်ဂှ် အဲဇန်လဝ် အင်ဂျင် OCR သွက်ဂွံဗှ်လိခ်မန်ရ။ မော်ဒယ်လၟုဟ်ဝွံ စကာလဝ် MobileNetV3 + BiLSTM သွက်ဂွံဗှ်လိခ်မန် ညံင်ဂွံဂွံတင်ဂုဏ်ဖိုလ်ရ။
my: ဒစ်ဂျစ်တယ် တည်ရှိမှု တိုးတက်စေရန် ဤ OCR အင်ဂျင်ကို တည်ဆောက်ခဲ့သည်။ MobileNetV3 + BiLSTM ကို အသုံးပြုထားသည်။

# about_inference
source: The engine uses ONNX Runtime Web to run locally in your browser. Your data never leaves your device.
mnw: အင်ဂျင်ဝွံ စကာလဝ် ONNX Runtime Web တုဲ ကၠောန်ကမၠောန် ပ္ဍဲဘရောက်ဇာ မၞးရ။ ဟွံဒးပလံင် တင်ဂရင် ပ္ဍဲဆာဗာတုဲ နွံကဵုဂီုက္ဍဟ်ရ။
my: ဤအင်ဂျင်သည် ONNX Runtime Web ကို အသုံးပြု၍ သင့်ဘရောက်ဇာတွင် တိုက်ရိုက် အလုပ်လုပ်ပါသည်။ သင်၏ အချက်အလက်များ ပြင်ပသို့ မရောက်ရှိပါ။

# about_hope
source: MonOCR aims to bridge the gap between physical texts and digital data, enabling new educational possibilities.
mnw: ဣဝွံ ဒှ်ကမၠောန် ဍောတ်တ်မွဲကီုလေဝ် အဲမိက်ဂွံကဵု MonOCR ဂှ် ဗိုင်ရီု သွက်ဂွံပြံင်လှာဲ လိခ်ပိုဲ ညံင်ဂွံဒှ် ဒစ်ဂျစ်တယ်တုဲ ဖန်ဗဒှ်အာ သွက်ပညာတၟိတၟိတအ်ရ။
my: မွန် OCR သည် စာအုပ်များမှ အချက်အလက်များကို ဒစ်ဂျစ်တယ်အဖြစ်သို့ ပြောင်းလဲပေးရန် ရည်ရွယ်သည်။

# docs_title
source: Documentation
mnw: လိခ်ဗွဟ်
my: စာရွက်စာတမ်းများ

# docs_getting_started
source: Getting Started
mnw: စပ္တံ
my: စတင်အသုံးပြုခြင်း

# docs_getting_started_desc
source: MonOCR Web works directly in your browser. No installation required. Upload an image or PDF to start.
mnw: MonOCR Web ဂှ် ကၠောန်ကမၠောန် ပ္ဍဲဘရောက်ဇာရ။ ဟွံဒးစုတ် software။ စုတ်ပ္တိုန်ရုပ် သာ်ဟွံသေင် PDF တုဲ စကာမာန်ရ။
my: မွန် OCR Web သည် ဘရောက်ဇာတွင် တိုက်ရိုက် အလုပ်လုပ်ပါသည်။ ဆော့ဖ်ဝဲလ် ထည့်သွင်းရန် မလိုပါ။

# docs_usage
source: How to Use
mnw: နဲစကာ
my: အသုံးပြုနည်း

# docs_usage_step1
source: 1. Select an image or PDF file.
mnw: ၁။ ရွေးစုတ် ဖိုင်ရုပ် သာ်ဟွံသေင် PDF။
my: ၁။ ပုံ သို့မဟုတ် PDF ဖိုင်ကို ရွေးပါ။

# docs_usage_step2
source: 2. Wait for the model to download (once).
mnw: ၂။ မင်ကဵု မော်ဒယ် ဒေါင်းလုဒ် တုဲဒှ်ညိ။
my: ၂။ မော်ဒယ် ဒေါင်းလုဒ်ဆွဲသည်အထိ ခဏစောင့်ပါ။

# docs_usage_step3
source: 3. Review the extracted text.
mnw: ၃။ စၟဳစၟတ် တင်လိခ် မတိတ်ကၠုင်ဂှ်ညိ။
my: ၃။ ထွက်ပေါ်လာသော စာသားကို စစ်ဆေးပါ။

# docs_usage_step4
source: 4. Copy or download the result.
mnw: ၄။ ကွုတ် သာ်ဟွံသေင် ဒေါင်းလုဒ် တင်ဂှ်ညိ။
my: ၄။ ကူးယူပါ သို့မဟုတ် ဒေါင်းလုဒ်ဆွဲပါ။

# docs_privacy
source: Privacy & Security
mnw: ဂီုက္ဍဟ်
my: ကိုယ်ရေးအချက်အလက် လုံခြုံမှု

# docs_privacy_desc
source: All processing happens on your machine. No files are uploaded to the internet.
mnw: ကမၠောန်ဖအိုတ်ဂှ် ကၠောန်ဒၟံင် ပ္ဍဲစက်မၞးရ။ ဟွံဒးပလံင် ဖိုင် ပ္ဍဲအေန်တာနေတ်ရ။
my: လုပ်ငန်းစဉ်အားလုံးသည် သင့်စက်ထဲတွင်သာ အလုပ်လုပ်ပါသည်။ ဖိုင်များကို အင်တာနက်ပေါ်သို့ ပေးပို့ခြင်း မရှိပါ။

# main_hero
source: Mon OCR Project for preserving Mon language in the digital age.
mnw: ပရဝ်ဂျေသူ Mon OCR သွက်ဂွံမင်မွဲအာ လိခ်မန် ပ္ဍဲလောက ဒစ်ဂျစ်တယ်ရ။
my: မွန်ဘာသာစကားကို ဒစ်ဂျစ်တယ်ခေတ်တွင် ထိန်းသိမ်းရန် မွန် OCR ပရောဂျက်။

# main_requirements
source: Requirements: Modern browser with hardware acceleration and 4GB+ RAM.
mnw: နိးနွံပၟိက် - Browser ခိုဟ်ဟ် ကဵု hardware acceleration ကေုာံ 4GB+ RAM ရ။
my: လိုအပ်ချက်များ - ခေတ်မီ ဘရောက်ဇာနှင့် 4GB+ RAM လိုအပ်သည်။

# main_model_info
source: Model file (26.3MB) is downloaded once and works offline.
mnw: မော်ဒယ်ဖိုင် (26.3MB) ဂှ် ဒေါင်းလုဒ် ဆွဲမွဲဝါတုဲ စကာအော့ဖ်လိုင်းမာန်ရ။
my: မော်ဒယ်ဖိုင် (26.3MB) ကို တစ်ကြိမ်သာ ဒေါင်းလုဒ်ဆွဲရန် လိုအပ်ပြီး အော့ဖ်လိုင်း အသုံးပြုနိုင်သည်။

# main_loading_model
source: Loading model from Hugging Face... (Please wait)
mnw: ဒေါင်းလုဒ် ဆွဲမံင် မော်ဒယ် နူ Hugging Face... (ခဏမင်ညိ)
my: မော်ဒယ်ကို ဒေါင်းလုဒ်ဆွဲနေသည်... (ခဏစောင့်ပါ)

# main_engine_ready
source: Engine ready (Cached for offline use)
mnw: အင်ဂျင် အဆင်ပြေယျ (သိမ်းလဝ် သွက်ဂွံစကာ အော့ဖ်လိုင်း)
my: အင်ဂျင် အဆင်သင့်ဖြစ်ပါပြီ (အော့ဖ်လိုင်း အသုံးပြုနိုင်ရန် သိမ်းထားပြီး)

# main_process_another
source: Process Another
mnw: စကာတၟိမွဲဝါပၠန်
my: အသစ် တစ်ကြိမ် ပြန်လုပ်ရန်

# main_extracted_text
source: Extracted Text
mnw: တင်လိခ် မတိတ်ကၠုင်
my: ထွက်ပေါ်လာသော စာသား

# main_words
source: Words
mnw: မလိခ်
my: စကားလုံး

# main_chars
source: Chars
mnw: မလိခ်
my: စာလုံး

# main_no_text
source: No text detected
mnw: ဟွံဂွံ တင်လိခ်
my: စာသား မတွေ့ပါ

# main_save_text
source: Save as Text File
mnw: သိမ်းလဝ် နကဵု ဖိုင်လိခ်
my: ဖိုင်အဖြစ် သိမ်းဆည်းရန်

# main_copy_clipboard
source: Copy
mnw: ကွုတ်
my: ကူးယူရန်

# main_copied
source: Copied!
mnw: ကွုတ်တုဲယျ!
my: ကူးယူပြီးပါပြီ!

# main_processing_page
source: Processing page {current} of {total}...
mnw: ကၠောန်မံင် မုက်လိခ် {current} ပ္ဍဲ {total}...
my: စာမျက်နှာ {current} ကို {total} ထဲမှ လုပ်ဆောင်နေသည်...

# error_engine_load
source: OCR Engine failed to load - {msg}
mnw: အေန်ဂျေၚ် OCR စကာဟွံဂွံ - {msg}
my: OCR အင်ဂျင် အလုပ်မလုပ်ပါ - {msg}

# error_file_large
source: File is too large (max {max}MB)
mnw: ဖိုင်ဇၞော်လောန်အာ (အောန်အိုတ် {max}MB)
my: ဖိုင် အရွယ်အစား ကြီးလွန်းသည် (အများဆုံး {max}MB)

# error_file_type
source: Invalid file type. Use JPG, PNG, WEBP, or PDF.
mnw: ဖိုင်ဟွံဒး။ စကာ JPG, PNG, WEBP, PDF ညိ။
my: ဖိုင်အမျိုးအစား မှားယွင်းနေသည်။ JPG, PNG, WEBP, PDF သာ အသုံးပြုပါ။

# error_pdf_failed
source: PDF processing failed - {msg}
mnw: PDF ကၠောန်ဟွံဂွံ - {msg}
my: PDF လုပ်ဆောင်မှု မအောင်မြင်ပါ - {msg}

# error_ocr_failed
source: OCR failed - {msg}
mnw: OCR ကၠောန်ဟွံဂွံ - {msg}
my: OCR လုပ်ဆောင်မှု မအောင်မြင်ပါ - {msg}

# footer_platform
source: Platform
mnw: ပလက်ဖောင်း
my: ပလက်ဖောင်း

# footer_community
source: Community
mnw: ဂကောံ
my: လူမှုအသိုင်းအဝိုင်း

# footer_legal
source: Legal
mnw: သၞောဝ်
my: ဥပဒေရေးရာ

# footer_api_docs
source: API Docs
mnw: လိခ်ဗွဟ် API
my: API စာရွက်စာတမ်း

# footer_integrations
source: Integrations
mnw: ပံင်ဗစိုပ်
my: ချိတ်ဆက်မှုများ

# footer_heritage_projects
source: Heritage Projects
mnw: ပရဝ်ဂျေသူ အာဲကၟာဲ
my: အမွေအနှစ် ပရောဂျက်များ

# footer_guidelines
source: Guidelines
mnw: တင်စညး
my: လမ်းညွှန်ချက်များ

# footer_forum
source: Forum
mnw: ဝိုင်ဓရီု
my: ဖိုရမ်

# footer_privacy
source: Privacy Policy
mnw: အခေါင်ပူဂိုလ်
my: ကိုယ်ရေးကိုယ်တာ မူဝါဒ

# footer_terms
source: Terms of Service
mnw: တင်စညး
my: စည်းကမ်းချက်များ

# footer_tagline
source: A production-grade OCR system for Mon language preservation.
mnw: ဒှ်စနစ် OCR မွဲ သွက်ဂွံမင်မွဲအာ လိခ်မန် ပ္ဍဲကဵု ဒၞာဲဒ္စာံ။
my: မွန်ဘာသာစကား ထိန်းသိမ်းရန် OCR စနစ် ဖြစ်သည်။
